# RbsSystemRisedrop1lineteeupsymbolParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsSystemRisedrop1lineteeupsymbolParam Property
ParameterTypeId Class See Also
---
"Single Line Tee Up Symbol"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsSystemRisedrop1lineteeupsymbolParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsSystemRisedrop1lineteeupsymbolParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsSystemRisedrop1lineteeupsymbolParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace